In [1]:
import pandas as pd

In [2]:
train = pd.read_csv('train.csv', index_col='PassengerId')
print(train.shape)
train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# 전체 생존률
survived_rate = train['Survived'].mean()
survived_rate = survived_rate * 100
print('생존률 = {:.1f}%'.format(survived_rate))

생존률 = 38.4%

In [5]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
# 성별 평균 생존률
train.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [7]:
pd.pivot_table(data = train, index= 'Sex', values= 'Survived')

        Survived
Sex
female  0.742038
male    0.188908

### Survived(Status) 라는 새로운 컬럼 만들기
#### 0(사망), 1(생존) => Perish(사망), Survived(생존) 으로 변환

In [8]:
train.loc[train['Survived'] == 0, 'Survived(Status)'] = 'Perish'
train.loc[train['Survived'] == 1, 'Survived(Status)'] = 'Survived'
train[['Survived','Survived(Status)']].head()

             Survived Survived(Status)
PassengerId
1                   0           Perish
2                   1         Survived
3                   1         Survived
4                   1         Survived
5                   0           Perish

In [9]:
train['Survived(Status)'].value_counts()

Perish      549
Survived    342
Name: Survived(Status), dtype: int64

## Pclass(Status) 라는 새로운 컬럼만들기
### 1,2,3 => First Class, Business, Economy

In [11]:
train.loc[train['Pclass'] == 1, 'Pclass(Status)'] = 'First Class'
train.loc[train['Pclass'] == 2, 'Pclass(Status)'] = 'Business'
train.loc[train['Pclass'] == 3, 'Pclass(Status)'] = 'Economy'
train[['Pclass','Pclass(Status)']].head()

             Pclass Pclass(Status)
PassengerId
1                 3        Economy
2                 1    First Class
3                 3        Economy
4                 1    First Class
5                 3        Economy

In [12]:
# Pclass 별 평균 생존률
pd.pivot_table(data=train, index='Pclass', values='Survived')

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [13]:
pd.pivot_table(data=train, index='Pclass(Status)', values='Survived')

                Survived
Pclass(Status)
Business        0.472826
Economy         0.242363
First Class     0.629630

In [14]:
train.groupby('Pclass(Status)')['Survived'].mean()

Pclass(Status)
Business       0.472826
Economy        0.242363
First Class    0.629630
Name: Survived, dtype: float64

## Embarked(Status) 라는 컬럼 만들기
### C,S,Q => Cherbourg, Southampton, Queenstown

In [15]:
train.loc[train['Embarked'] == 'C', 'Embarked(Status)'] = 'Cherbourg'
train.loc[train['Embarked'] == 'S', 'Embarked(Status)'] = 'Southampton'
train.loc[train['Embarked'] == 'Q', 'Embarked(Status)'] = 'Queenstown'
train[['Embarked','Embarked(Status)']].head()

            Embarked Embarked(Status)
PassengerId
1                  S      Southampton
2                  C        Cherbourg
3                  S      Southampton
4                  S      Southampton
5                  S      Southampton

In [16]:
# Embarked 별 평균 생존률
pd.pivot_table(data=train, index='Embarked', values='Survived')

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.336957

In [17]:
pd.pivot_table(data=train, index='Embarked(Status)', values='Survived')

                  Survived
Embarked(Status)
Cherbourg         0.553571
Queenstown        0.389610
Southampton       0.336957

## Embarked 컬럼과 Pclass 컬럼 One Hot Encoding

  1. **Embarked(C)** - Embarked 컬럼 안에 있는 값이 C면 True, 아니면 False가 들어갑니다.
  1. **Embarked(S)** - Embarked 컬럼 안에 있는 값이 S면 True, 아니면 False가 들어갑니다.
  1. **Embarked(Q)** - Embarked 컬럼 안에 있는 값이 Q면 True, 아니면 False가 들어갑니다.

In [19]:
train['Embarked(C)'] = train['Embarked'] == 'C'
train['Embarked(S)'] = train['Embarked'] == 'S'
train['Embarked(Q)'] = train['Embarked'] == 'Q'

train[['Embarked', 'Embarked(Status)', 'Embarked(C)','Embarked(S)','Embarked(Q)']].head()

            Embarked Embarked(Status)  Embarked(C)  Embarked(S)  Embarked(Q)
PassengerId
1                  S      Southampton        False         True        False
2                  C        Cherbourg         True        False        False
3                  S      Southampton        False         True        False
4                  S      Southampton        False         True        False
5                  S      Southampton        False         True        False

  1. **Pclass(F)** - Pclass 컬럼 안에 있는 값이 1이면 True, 아니면 False가 들어갑니다.
  1. **Pclass(B)** - Pclass 컬럼 안에 있는 값이 2면 True, 아니면 False가 들어갑니다.
  1. **Pclass(E)** - Pclass 컬럼 안에 있는 값이 3이면 True, 아니면 False가 들어갑니다.

In [21]:
train['Pclass(F)'] = train['Pclass'] == 1
train['Pclass(B)'] = train['Pclass'] == 2
train['Pclass(E)'] = train['Pclass'] == 3

train[['Pclass', 'Pclass(Status)', 'Pclass(F)', 'Pclass(B)', 'Pclass(E)']].head()

             Pclass Pclass(Status)  Pclass(F)  Pclass(B)  Pclass(E)
PassengerId
1                 3        Economy      False      False       True
2                 1    First Class       True      False      False
3                 3        Economy      False      False       True
4                 1    First Class       True      False      False
5                 3        Economy      False      False       True

## 나이(Age) 컬럼 분석

  * 평균(mean)
  * 표준편차(standard deviation, 이하 std) 
  * 가장 나이가 많은 사람.
  * 가장 나이가 적은 사람.

In [22]:
train['Age'].mean()

29.69911764705882

In [23]:
train['Age'].std()

14.526497332334044

In [25]:
train['Age'].max()

80.0

In [26]:
train['Age'].min()

0.42

In [27]:
train['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [28]:
train.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## 객실 등급별 나이

In [29]:
train[train['Pclass'] == 1]['Age'].mean()

38.233440860215055

In [30]:
train[train['Pclass'] == 2]['Age'].mean()

29.87763005780347

In [31]:
train[train['Pclass'] == 3]['Age'].mean()

25.14061971830986

In [32]:
train.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [33]:
pd.pivot_table(data=train, index='Pclass', values='Age')

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

## 나이별 생존률
  1. 나이가 15세 미만인 승객.
  2. 나이가 15세 이상이고 30세 미만인 승객.
  3. 나이가 30세 이상인 승객.

In [35]:
# 나이 구간 나누기
train.loc[train['Age'] < 15, 'AgeType'] = 'Young'
train.loc[(train['Age'] >= 15) & (train['Age'] < 30), 'AgeType'] = 'Medium'
train.loc[train['Age'] >= 30, 'AgeType'] = 'Old'
train[['Age','AgeType']].head(10)

              Age AgeType
PassengerId
1            22.0  Medium
2            38.0     Old
3            26.0  Medium
4            35.0     Old
5            35.0     Old
6             NaN     NaN
7            54.0     Old
8             2.0   Young
9            27.0  Medium
10           14.0   Young

In [36]:
# 나이 구간별 생존률
pd.pivot_table(data=train, index='AgeType', values='Survived')

         Survived
AgeType
Medium   0.362745
Old      0.406061
Young    0.576923